<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8370a850bfe38e18d18d8dc1527587020b14ab12589bf12d9884794c516dd894","plan_job_ref":"Job Plan Airflow DAGs #442 at https://github.com/cal-itp/data-infra/actions/runs/16764877330","plan_out_hash":"9fca77b85c9ae2a3de432de13cf57ddb88c3e76e3e7228f8d858d2002f45e6a0","plan_hash":"08e8abd26c94a72b66093b7090baa41d85e75c467e14885847f0798170e81216","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/_mart_benefits.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "eYtR6w==" -> (known after apply)
!~      detect_md5hash      = "MsQ5kwlpnUzlwTwigDwT3A==" -> "different hash"
!~      generation          = 1749663113306204 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/_mart_benefits.yml"
!~      md5hash             = "MsQ5kwlpnUzlwTwigDwT3A==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/_mart_benefits.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "FD1C8g==" -> (known after apply)
!~      detect_md5hash      = "VM3WMD32/sAzm/CYz4TRgQ==" -> "different hash"
!~      generation          = 1749663112586197 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "VM3WMD32/sAzm/CYz4TRgQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #442](https://github.com/cal-itp/data-infra/actions/runs/16764877330)